SET datestyle = 'ISO, DMY';

-- ===== catalog =====
INSERT INTO catalog.categories (name) VALUES
('Художественная литература'), ('Научно-популярная литература'),
('Книги для детей'), ('Учебная литература');

INSERT INTO catalog.publishers (name) VALUES
('Эксмо'), ('АСТ'), ('Азбука'), ('Национальное образование');

INSERT INTO catalog.books (
    name, description, category_id, publisher_id, isbn,
    age_limit, publication_date, pages_number, weight, price
) VALUES
('Ритуал', 'Фантасты Мария и Сергей Дяченко считают книгу «Ритуал» своим самым романтичным произведением. Текст старого ритуала гласит, что каждый дракон должен похитить и умертвить прекрасную принцессу. Но Арман — дракон, который пишет стихи, а Юта — принцесса, которую никто не хочет спасать.',
 1, 1, '978-5-04-199666-6', '16+', '2024', 320, 290, 707),
('Общество спектакля', 'Работа посвящена анализу и критике как западной капиталистической системы, так и советской авторитарной системы.',
 2, 2, '978-5-17-173268-4', '16+', '2025', 320, 290, 801),
('Человек недостойный', 'Самая известная повесть Осаму Дадзая. Произведение во многом автобиографическое.',
 1, 2, '978-5-17-161044-9', '16+', '2025', 192, 130, 365),
('Страсть обманет смерть', 'Мрачная, но не лишенная света история о Судеб, драконах и запретных чувствах.',
 1, 1, '978-5-04-199612-3', '16+', '2025', 352, 320, 943),
('Странный дом', 'Загадочная история о доме с необычной планировкой и зловещими деталями.',
 1, 1, '978-5-04-206381-7', '16+', '2025', 256, 10, 809),
('Человек-бензопила. Том 13', 'Весь мир сходит с ума под влиянием темных планов «Церкви Человека-Бензопилы».',
 1, 3, '978-5-389-27240-8', '18+', '2025', 184, 10, 1168),
('Я воспитываю черного дракона. Том 1', 'Популярный вебтун с платформы Kakao. Офисная сотрудница Ноа перерождается в злодейку из романа.',
 1, 2, '978-5-17-171814-5', '12+', '2025', 264, 610, 1651),
('Волшебник Изумрудного города', 'Первая история из цикла книг про Изумрудный город.',
 3, 2, '978-5-17-098370-4', '0+', '2024', 208, 480, 1096),
('ОГЭ-2025. Математика: 36 вариантов', 'Серия подготовлена разработчиками КИМ ОГЭ.',
 4, 4, '978-5-4454-1825-2', '0+', '2025', 224, 360, 1415),
('ЕГЭ-2025. Математика. Базовый уровень: 30 вариантов', 'Серия подготовлена разработчиками КИМ ЕГЭ.',
 4, 4, '978-5-4454-1802-3', '0+', '2025', 192, 320, 1415);

INSERT INTO catalog.genres (name) VALUES
('Фэнтези'), ('Романтика'), ('Философия'), ('Социология'),
('Повесть'), ('Детектив'), ('Хоррор'), ('Манга'), ('Сказка');

INSERT INTO catalog.books_genres (book_id, genre_id) VALUES
(1,1),(1,2),(2,3),(2,4),(3,5),(4,1),(4,2),(5,6),(5,7),(6,8),(7,8),(8,9);

INSERT INTO catalog.authors (first_name, last_name) VALUES
('Марина','Дяченко'),('Сергей','Дяченко'),('Ги','Дебор'),
('Дадзай','Осаму'),('Катерина','Полянская'),('Фудзимото','Тацуки'),
('Тальсыль','Сотхан'),('Александр','Волков'),('Иван','Ященко'),('Укэцу', NULL);

INSERT INTO catalog.books_authors (book_id, author_id) VALUES
(1,1),(1,2),(2,3),(3,4),(4,5),(6,6),(7,7),(8,8),(9,9),(10,9),(5,10);

INSERT INTO catalog.reviews (book_id, customer_id, date, rating, text) VALUES
(3,5,'2024-11-25',5,'Решила прочесть эту автобиографию из-за того, что посмотрела аниме...'),
(1,3,'2025-01-10',5,'Юта — далеко не самая прекрасная принцесса...'),
(3,4,'2025-01-21',3,'У меня остались противоречивые ощущения от прочтения этой книги...'),
(1,2,'2025-02-07',4,'Это очень увлекательная сказка о принцессе и драконе...'),
(5,6,CURRENT_DATE,5,'Хочу себе такую же обложку...');

-- ===== inventory =====
INSERT INTO inventory.stock_items (book_id, quantity) VALUES
(1,2),(2,4),(3,3),(4,5),(5,3),(6,0),(7,4),(8,0),(9,8),(10,8);

INSERT INTO inventory.suppliers (name) VALUES
('ИП Алексей Краснов'), ('ИП Владислав Никулин');

INSERT INTO inventory.purchases (supplier_id, time, total_cost) VALUES
(1,'2024-10-01 08:52:01',26380),
(2,'2024-10-02 08:55:22',28300);

INSERT INTO inventory.books_purchases (book_id, purchase_id, quantity) VALUES
(1,1,5),(2,1,5),(3,1,5),(4,1,5),(5,1,5),(7,1,5),(9,2,10),(10,2,10);

-- ===== sales =====
INSERT INTO sales.payment_methods (name) VALUES
('Наличные'), ('Банковская карта'), ('СБП');

INSERT INTO sales.couriers (name) VALUES ('Артемий'), ('Илья');
INSERT INTO sales.deliveries (courier_id) VALUES (1),(1),(2),(2);

INSERT INTO sales.customers (first_name, last_name, birth_date, phone, email) VALUES
('Ольга','Сосновская','2003-02-02','+79550560155','olga.sosnovskaya@mail.ru'),
('Евгения','Моисеенко','1995-08-13','+79552409211','evgeniya.moiseenko@gmail.com'),
('Мария','Чадаева','1991-02-04','+79060480692','mariya.chadaeva@gmail.com'),
('Полина','Токарева','1998-02-07','+79956347505','polina.tokareva@mail.ru'),
('Патимат','Магомедова','2002-02-03','+79943591499','patimat.magomedova@mail.ru'),
('Даниил','Степанов','1991-03-17','+79624430402','daniil.stepanov@gmail.com'),
('Демид','Филатов','2007-06-13','+79541188772','demid.filatov@gmail.com'),
('Елизавета','Сорокина','1995-03-12','+79166499528','elizaveta.sorokina@yandex.ru'),
('Полина','Тихонова','2000-04-04','+79895394923','polina.tikhonova@mail.ru'),
('Мирон','Гусев','2001-01-17','+79969429852','miron.gusev@gmail.com'),
('Екатерина','Прокофьева','2005-07-25','+79390176983','ekaterina.prokofeva@yandex.ru'),
('Михаил','Васильев','2004-11-26','+79671544144','mikhail.vasilev@mail.ru'),
('Андрей','Фомичев','1998-01-21','+79136787147','andrei.fomichev@mail.ru'),
('Иван','Антонов','1994-06-21','+79127139181','ivan.antonov@yandex.ru');

INSERT INTO sales.orders (customer_id, payment_method_id, delivery_id, time, total_cost, status) VALUES
(1,3,1,'2024-10-06 19:48:42',1516,'CONFIRMED'),
(1,3,2,'2024-10-27 17:11:23',1651,'CONFIRMED'),
(5,2,3,'2024-12-02 08:38:40',365,'CONFIRMED'),
(3,2,4,'2024-12-29 23:29:05',707,'CONFIRMED'),
(4,2,NULL,'2025-01-16 10:47:17',1166,'CONFIRMED'),
(2,2,NULL,'2025-01-18 16:47:22',707,'CONFIRMED'),
(7,1,NULL,'2025-01-20 18:03:26',5660,'CONFIRMED'),
(6,3,NULL,CURRENT_TIMESTAMP,809,'CONFIRMED');

INSERT INTO sales.books_orders (order_id, book_id, quantity) VALUES
(1,1,1),(1,5,1),(2,7,1),(3,3,1),(4,1,1),
(5,2,1),(5,3,1),(6,1,1),(7,9,2),(7,10,2),(8,5,1);
